[Pandas DataFrame数据的增、删、改、查] https://blog.csdn.net/zhangchuang601/article/details/79583551

In [1]:
import pandas as pd
import numpy as np

按列增加

In [2]:
df = pd.DataFrame(data = [['tom1','f',22],['tom2','f',22],['tom3','m',21]],index = [1,2,3],columns = ['name','sex','age'])#测试数据。
df

   name sex  age
1  tom1   f   22
2  tom2   f   22
3  tom3   m   21

In [3]:
citys = ['shenzhen1','shenzhen2','shenzhen3']
df.insert(2,'city',citys) #在第2列，加上column名称为city，值为citys的数值。
jobs = ['student','teacher','teacher']
df['job'] = jobs #默认在df最后一列加上column名称为job，值为jobs的数据。
df.loc[:,'salary'] = ['1k','2k','2k'] #在df最后一列加上column名称为salary，值为等号右边数据。
df

   name sex       city  age      job salary
1  tom1   f  shenzhen1   22  student     1k
2  tom2   f  shenzhen2   22  teacher     2k
3  tom3   m  shenzhen3   21  teacher     2k

按行增加

In [4]:
#若df中没有index为“4”的这一行的话，该行代码作用是往df中加一行index为“4”，值为等号右边值的数据。
#若df中已经有index为“4”的这一行，则该行代码作用是把df中index为“4”的这一行修改为等号右边数据。
df.loc[4] = ['tom4','m','shenzhen4',24,"engineer",'3k']
df

   name sex       city  age       job salary
1  tom1   f  shenzhen1   22   student     1k
2  tom2   f  shenzhen2   22   teacher     2k
3  tom3   m  shenzhen3   21   teacher     2k
4  tom4   m  shenzhen4   24  engineer     3k

In [5]:
# 按照age的值进行排序
df=df.sort_values(by=["age"],ascending=False)
df

   name sex       city  age       job salary
4  tom4   m  shenzhen4   24  engineer     3k
1  tom1   f  shenzhen1   22   student     1k
2  tom2   f  shenzhen2   22   teacher     2k
3  tom3   m  shenzhen3   21   teacher     2k